## Plan Result (Prod - TerraformPlanApply)




<pre><code>Plan: 5 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * module.appeal-infected-blood-compensation-decision.azurerm_dns_cname_record.this[&#34;*&#34;]
  * module.appeal-infected-blood-compensation-decision.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.appeal-infected-blood-compensation-decision.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.appeal-infected-blood-compensation-decision.azurerm_dns_zone.zone
  * module.appeal-infected-blood-compensation-decision.azurerm_role_assignment.dnszonecontributer
* Update
  * module.ctsc-hmcts.azurerm_dns_cname_record.this[&#34;_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.preprod&#34;]
  * module.ctsc-hmcts.azurerm_dns_cname_record.this[&#34;_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.training&#34;]
  * module.prod-platform.azurerm_dns_cname_record.this[&#34;_ac285a78514b19d657b18c29b98f4c7f.vh-admin-web&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.appeal-infected-blood-compensation-decision.azurerm_dns_cname_record.this["*"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "*"
      + record              = "www.appeal-infected-blood-compensation-decision.service.gov.uk"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "appeal-infected-blood-compensation-decision.service.gov.uk"
    }

  # module.appeal-infected-blood-compensation-decision.azurerm_dns_cname_record.this["afdverify.www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.www"
      + record              = "afdverify.hmcts-prod-hdgpbqdkafhmcse9.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "appeal-infected-blood-compensation-decision.service.gov.uk"
    }

  # module.appeal-infected-blood-compensation-decision.azurerm_dns_cname_record.this["www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = "hmcts-prod-hdgpbqdkafhmcse9.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "appeal-infected-blood-compensation-decision.service.gov.uk"
    }

  # module.appeal-infected-blood-compensation-decision.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "appeal-infected-blood-compensation-decision.service.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record (known after apply)
    }

  # module.appeal-infected-blood-compensation-decision.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ctsc-hmcts.azurerm_dns_cname_record.this["_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.preprod"] will be updated in-place
  ~ resource "azurerm_dns_cname_record" "this" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/ctsc.hmcts.net/CNAME/_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.preprod"
        name                = "_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.preprod"
      ~ record              = "603D81996C47863EDFE41A6ED2EF3224.A1363BE712CA02F75C3C5259EC7D4680.9b1211e0578d0fbcf7ab.sectigo.com." -> "603D81996C47863EDFE41A6ED2EF3224.A1363BE712CA02F75C3C5259EC7D4680.586ee5cb5f17541372cd.sectigo.com."
        tags                = {}
        # (5 unchanged attributes hidden)
    }

  # module.ctsc-hmcts.azurerm_dns_cname_record.this["_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.training"] will be updated in-place
  ~ resource "azurerm_dns_cname_record" "this" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/ctsc.hmcts.net/CNAME/_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.training"
        name                = "_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.training"
      ~ record              = "603D81996C47863EDFE41A6ED2EF3224.A1363BE712CA02F75C3C5259EC7D4680.9b1211e0578d0fbcf7ab.sectigo.com." -> "603D81996C47863EDFE41A6ED2EF3224.A1363BE712CA02F75C3C5259EC7D4680.586ee5cb5f17541372cd.sectigo.com."
        tags                = {}
        # (5 unchanged attributes hidden)
    }

  # module.prod-platform.azurerm_dns_cname_record.this["_ac285a78514b19d657b18c29b98f4c7f.vh-admin-web"] will be updated in-place
  ~ resource "azurerm_dns_cname_record" "this" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/prod.platform.hmcts.net/CNAME/_ac285a78514b19d657b18c29b98f4c7f.vh-admin-web"
        name                = "_ac285a78514b19d657b18c29b98f4c7f.vh-admin-web"
      ~ record              = "032DDB9A61BB0588601DD6D4C005A812.302202E1FB30DE99CD976C202BDB71AC.d7703fe5d42a59a77748.sectigo.com." -> "032DDB9A61BB0588601DD6D4C005A812.302202E1FB30DE99CD976C202BDB71AC.fbb25c1fc3c9ad12a80d.sectigo.com."
        tags                = {}
        # (5 unchanged attributes hidden)
    }

Plan: 5 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1861,"Program":"tfcmt","SHA1":"","Target":"Prod - TerraformPlanApply","Vars":{}} -->